app/Controllers/Frontend/BlogController.php

SELECT *
FROM `clinic001_default_client_config`
WHERE `domain_live_url` = 'http://localhost:8080/'
---
    public function index()
    {
        // connect db
        $db = \Config\Database::connect();
        // client config
        $client_config = $db->table('clinic001_default_client_config');
        $client_config_data = $client_config->where("domain_live_url", base_url())->get()->getFirstRow();