app/Controllers/Frontend/BlogController.php

SELECT *
FROM `clinic001_config_menu`
WHERE `client_id` = 'ad8caa8d-bd03-11ed-aeb8-b0227a7395f6'
AND `status` = 1
---
    public function index($trial_name = null)
    {
        // client
        $client_model = new ClientModel();
        $client = $client_model->where("domain_live_url", base_url())->where('status', 1)->get()->getFirstRow();
        if ($client->is_production == 1) {
            $is_production = 1;
            $client_id = $client->id;
        } else {
            $is_production = 0;
            if ($trial_name != null) {
                $trial_access_name = $trial_name;
            } else {
                $trial_access_name = null;
            }
            $client = $client_model->where("domain_live_url", base_url())->where('trial_access_name', $trial_access_name)->where('status', 1)->get()->getFirstRow();
            if ($client) {
                $client_id = $client->id;
            }else{
                return redirect()->to(base_url('/'));
            }
        }
        // define trial or prod
        $data['trial_name'] = $trial_name;
        $data['is_production'] = $is_production;
        // config
        $config = new ConfigModel();
        $data['config'] = $config->where('client_id', $client_id)->where('status', 1)->get()->getFirstRow();
        // config menu
        $config_menu = new ConfigMenuModel();
        $data['config_menu'] = $config_menu->where('client_id', $client_id)->where('status', 1)->get()->getFirstRow();

SELECT *
FROM `clinic001_footer_feature`
WHERE `client_id` = 'ad8caa8d-bd03-11ed-aeb8-b0227a7395f6'
AND `status` = 1
---
        $data['departments'] = $department->where('client_id', $client_id)->where('status', 1)->get()->getResult();
        // footer feature
        $footer_feature = new FooterFeatureModel();
        $data['footer_features'] = $footer_feature->where('client_id', $client_id)->where('status', 1)->get()->getResult();

SELECT *
FROM `clinic001_blog_category`
WHERE `client_id` = 'ad8caa8d-bd03-11ed-aeb8-b0227a7395f6'
AND `status` = 1
SELECT *
FROM `clinic001_appointment_type`
WHERE `client_id` = 'ad8caa8d-bd03-11ed-aeb8-b0227a7395f6'
AND `status` = 1
---
        $data['tweets'] = $tweet->where('client_id', $client_id)->where('status', 1)->get()->getResult();
        // blog category
        $blog_category = new BlogCategoryModel();
        $data['blog_categories'] = $blog_category->where('client_id', $client_id)->where('status', 1)->get()->getResult();
        // apppointment type
        $appointment_type = new AppointmentTypeModel();
        $data['appointment_types'] = $appointment_type->where('client_id', $client_id)->where('status', 1)->get()->getResult();