app/Controllers/Frontend/BuildController.php

    public function index($app_id, $client_id, $prefix)
    {
        // connect db
        $db = \Config\Database::connect();
        $builder = $db->table("clinic001_config");
        // get app
        $app = $builder->where('app_id', $app_id)->get()->getFirstRow();
        if ($app) {
            $client_config = $db->table("clinic001_client_config");
            $client_config_data = $client_config->where('app_id', $app_id)->where('client_id', $client_id)->get()->getFirstRow();
            if ($client_config_data) {
                session()->setFlashdata('info', 'You already have an account, please login to continue.');
                return redirect()->to(base_url('ext-login'));
            }else{
                // insert to client config
                $client_config = new ClientConfigModel();
                $client_config->insert([
                    'created_at' => date('Y-m-d H:i:s'),
                    'client_id' => $client_id,
                    'app_id' => $app_id,
                    'domain_live_url' => base_url(),
                    'trial_access_name' => $prefix,
                    'is_production' => 0
                ]);
---
SELECT *
FROM `clinic001_config`
WHERE `app_id` = '66793fb6-b1c9-11ed-80f6-c465162ee099'
SELECT *
FROM `clinic001_client_config`
WHERE `app_id` = '66793fb6-b1c9-11ed-80f6-c465162ee099'
AND `client_id` = '03d8e7e2-bcf6-11ed-aeb8-b0227a7395f6'
INSERT INTO `clinic001_client_config` (`created_at`, `client_id`, `app_id`, `domain_live_url`, `trial_access_name`, `is_production`) VALUES ('2023-03-07 16:13:18', '03d8e7e2-bcf6-11ed-aeb8-b0227a7395f6', '66793fb6-b1c9-11ed-80f6-c465162ee099', 'http://localhost:8080/', 'dodi', 0)