app/Controllers/Frontend/ContactController.php

SELECT *
FROM `config`
SELECT *
FROM `clinic001_config_menus`
SELECT *
FROM `config_menus`
SELECT *
FROM `departments`
SELECT *
FROM `clinic001_footer_features`
SELECT *
FROM `footer_features`
SELECT *
FROM `blogs`
SELECT *
FROM `tweets`
---
    public function index()
    {
        // configuration
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();
        // configuration menu
        $config_menu = new ConfigMenuModel();
        $data['config_menu'] = $config_menu->get()->getFirstRow();
        // department
        $department = new DepartmentModel();
        $data['departments'] = $department->get()->getResult();
        // footer feature
        $footer_feature = new FooterFeatureModel();
        $data['footer_features'] = $footer_feature->get()->getResult();
        // blog
        $blog = new BlogModel();
        $data['blogs'] = $blog->get()->getResult();
        $db = \Config\Database::connect();
        $data['blogs'] = $db->query('
            SELECT
                blogs.*,
                blog_categories.name as category_name
            FROM blogs JOIN blog_categories
            ON blogs.blog_category_id = blog_categories.id
            WHERE blogs.status != 0
        ')->getResult();
        // tweets
        $tweet = new TweetModel();
        $data['tweets'] = $tweet->get()->getResult();