app/Controllers/Frontend/HomeController.php

    public function index()
    {
        // connect db
        $db = \Config\Database::connect();
        // client config
        $client_config = $db->table('clinic001_default_client_config');
        $client_config_data = $client_config->where("domain_live_url", base_url())->get()->getFirstRow();
        if ($client_config_data->is_production == 1) {
            $trial_access_name = $client_config_data->trial_access_name;
        }else{
            $uri = new \CodeIgniter\HTTP\URI(current_url());
            $trial_access_name = $uri->getSegment(2);
        }
        // config
        $config = $db->table("clinic001_" . $trial_access_name . "_config");
        $data['config']   = $config->get()->getFirstRow();
        // config menu
        $config_menu = $db->table("clinic001_" . $trial_access_name . "_config_menus");
        $data['config_menu'] = $config_menu->get()->getFirstRow();
        // department
        $department = $db->table("clinic001_" . $trial_access_name . "_departments");
        $data['departments'] = $department->get()->getResult();
        // slider
        $slider = $db->table("clinic001_" . $trial_access_name . "_sliders");
        $data['sliders'] = $slider->get()->getResult();
        // slider feature
        $slider_feature = $db->table("clinic001_" . $trial_access_name . "_slider_features");
        $data['slider_features'] = $slider_feature->get()->getResult();
        // footer feature
        $footer_feature = $db->table("clinic001_" . $trial_access_name . "_footer_features");
        $data['footer_features'] = $footer_feature->get()->getResult();
        // apppointment type
        $appointment = $db->table("clinic001_" . $trial_access_name . "_appointments");
        $data['appointment_types'] = $appointment->get()->getResult();
        // blog
        $blog = $db->table("clinic001_" . $trial_access_name . "_blogs");
        $data['blogs'] = $blog->get()->getResult();
---
SELECT *
FROM `clinic001_client_config`
WHERE `domain_live_url` = 'http://localhost:8080/'
SELECT *
FROM `clinic001_default_client_config`
WHERE `domain_live_url` = 'http://localhost:8080/'
SELECT *
FROM `config`
SELECT *
FROM `clinic001_config_menus`
SELECT *
FROM `config_menus`
SELECT *
FROM `departments`
SELECT *
FROM `sliders`
SELECT *
FROM `clinic001_slider_features`
SELECT *
FROM `slider_features`
SELECT *
FROM `clinic001_footer_features`
SELECT *
FROM `footer_features`
SELECT *
FROM `clinic001_appointment_types`
SELECT *
FROM `blogs`

        ")->getResult();
        // tweets
        $tweet = $db->table("clinic001_" . $trial_access_name . "_tweets");
        $data['tweets'] = $tweet->get()->getResult();
---
SELECT *
FROM `tweets`