app/Controllers/Frontend/MedicalCareController.php

    public function index()
    {
        // configuration
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();
        // configuration menu
        $config_menu = new ConfigMenuModel();
        $data['config_menu'] = $config_menu->get()->getFirstRow();
        // footer feature
        $footer_feature = new FooterFeatureModel();
        $data['footer_features'] = $footer_feature->get()->getResult();
        // department
        $department = new DepartmentModel();
        $data['departments'] = $department->get()->getResult();
        // blog
        $blog = new BlogModel();
        $data['blogs'] = $blog->get()->getResult();
        $db = \Config\Database::connect();
        $data['blogs'] = $db->query('
            SELECT
                clinic001_blogs.*,
                clinic001_blog_categories.name as category_name
            FROM clinic001_blogs JOIN clinic001_blog_categories
            ON clinic001_blogs.blog_category_id = clinic001_blog_categories.id
            WHERE clinic001_blogs.status != 0
        ')->getResult();
        // tweets
        $tweet = new TweetModel();
        $data['tweets'] = $tweet->get()->getResult();
        // medical care
        $medical_care = new MedicalCareModel();
        $data['medical_cares'] = $medical_care->get()->getResult();
        $data['medical_care_count'] = $medical_care->countAllResults();
        // department
        $clinic = new ClinicModel();
        $data['clinics'] = $clinic->get()->getResult();
        // testimonial
        $testimonial = new TestimonialModel();
        $data['testimonials'] = $testimonial->get()->getResult();
---
SELECT *
FROM `config`
SELECT *
FROM `config_menus`
SELECT *
FROM `footer_features`
SELECT *
FROM `departments`
SELECT *
FROM `blogs`
SELECT *
FROM `tweets`
SELECT *
FROM `medical_cares`
SELECT COUNT(*) AS `numrows`
FROM `medical_cares`
SELECT *
FROM `clinics`
SELECT *
FROM `testimonials`