app/Controllers/Extranet/AboutController.php

SELECT *
FROM `config`
SELECT *
FROM `about`
---
    public function index()
    {
        // config
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();
        // about
        $about = new AboutModel();
        $data['about'] = $about->get()->getFirstRow();