app/Controllers/Extranet/BlogController.php

    public function index()
    {
        // config
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();
        // blog
        $blog = new BlogModel();
        $data['blogs'] = $blog->get()->getResult();
---
SELECT *
FROM `config`
SELECT *
FROM `blogs`