app/Controllers/Extranet/ConfigMenuController.php

SELECT *
FROM `config`
SELECT *
FROM `config_menus`
---
    public function index()
    {
        // config
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();
        // menu config
        $config_menu = new ConfigMenuModel();
        $data['config_menu'] = $config_menu->get()->getFirstRow();