app/Controllers/Extranet/DepartmentController.php

    public function index()
    {
        // config
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();
        // department
        $department = new DepartmentModel();
        $data['departments'] = $department->get()->getResult();
---
SELECT *
FROM `config`
SELECT *
FROM `departments`