app/Controllers/Extranet/FooterFeatureController.php

DELETE FROM `clinic001_footer_feature`
WHERE `id` IN ('f14a5310-c0e8-11ed-a756-b0227a7395f6')
---
    public function destroy($id)
    {
        $footer_feature = new FooterFeatureModel();
        $footer_feature->delete($id);