app/Controllers/Extranet/HomeExtranetController.php

    public function index()
    {
        $config = new ConfigModel();
        $data['config'] = $config->get()->getFirstRow();
---
SELECT *
FROM `config`