app/Controllers/Extranet/LaboratoryFeatureController.php

SELECT *
FROM `clinic001_laboratory_feature`
WHERE `client_id` = 'ad8caa8d-bd03-11ed-aeb8-b0227a7395f6'
---
    public function index()
    {
        // config
        $config = new ConfigModel();
        $data['config'] = $config->where('client_id', session()->get('client_id'))->where('status', 1)->get()->getFirstRow();
        // laboratory_feature
        $laboratory_feature = new LaboratoryFeatureModel();
        $data['laboratory_features'] = $laboratory_feature->where('client_id', session()->get('client_id'))->get()->getResult();